JustinPead/stm32_f446_i2c_demo/stm010_blank/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CTRL_PWR_LIGHT_Pin GPIO_PIN_14
#define CTRL_PWR_LIGHT_GPIO_Port GPIOC
#define CTRL_PWR_TEMP_Pin GPIO_PIN_15
#define CTRL_PWR_TEMP_GPIO_Port GPIOC
#define SENSE_LIGHT_Pin GPIO_PIN_0
#define SENSE_LIGHT_GPIO_Port GPIOA
#define CTRL_PWR_RADIO_Pin GPIO_PIN_1
#define CTRL_PWR_RADIO_GPIO_Port GPIOA
#define SENSE_PWR_Pin GPIO_PIN_3
#define SENSE_PWR_GPIO_Port GPIOA
#define E_DRV_Pin GPIO_PIN_4
#define E_DRV_GPIO_Port GPIOA
#define D_DRV_Pin GPIO_PIN_5
#define D_DRV_GPIO_Port GPIOA
#define DP_DRV_Pin GPIO_PIN_6
#define DP_DRV_GPIO_Port GPIOA
#define GRID1_DRV__Pin GPIO_PIN_7
#define GRID1_DRV__GPIO_Port GPIOA
#define A_DRV_Pin GPIO_PIN_0
#define A_DRV_GPIO_Port GPIOB
#define F_DRV_Pin GPIO_PIN_1
#define F_DRV_GPIO_Port GPIOB
#define GRID2_DRV_Pin GPIO_PIN_8
#define GRID2_DRV_GPIO_Port GPIOA
#define GRID3_DRV_Pin GPIO_PIN_9
#define GRID3_DRV_GPIO_Port GPIOA
#define B_DRV_Pin GPIO_PIN_10
#define B_DRV_GPIO_Port GPIOA
#define C_DRV_Pin GPIO_PIN_11
#define C_DRV_GPIO_Port GPIOA
#define G_DRV_Pin GPIO_PIN_12
#define G_DRV_GPIO_Port GPIOA
#define PB0_Pin GPIO_PIN_15
#define PB0_GPIO_Port GPIOA
#define CTRL_LEDS_Pin GPIO_PIN_3
#define CTRL_LEDS_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_4
#define LED1_GPIO_Port GPIOB
#define LED0_Pin GPIO_PIN_5
#define LED0_GPIO_Port GPIOB
#define PB1_Pin GPIO_PIN_9
#define PB1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
